Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCorniceIntegralError Property
 Could not create integral wall sweep for wall instance. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCorniceIntegralError { get; }
Public Shared ReadOnly Property CannotCreateCorniceIntegralError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCorniceIntegralError {
	FailureDefinitionId^ get ();
}
static member CannotCreateCorniceIntegralError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace